const prevBtn = document.getElementById("prev");
const nextBtn = document.getElementById("next");
const feedbackImg = document.getElementById("img");
const feedbackArticle = document.getElementById("article");
const feedbackName = document.getElementById("name");
let currentFeedbackIndex = 0;

const feedbacks = [
  {
    name: "Максим",
    imageSrc: "./img/max_feed.jpeg",
    text: `Я надзвичайно вдячний за професіоналізм і високу компетентність
    юриста Олександра Петрова. Він надав мені важливу правову
    консультацію щодо моєї міжнародної бізнес-діяльності, і його
    поради були дуже цінними. Олександр виявив велике розуміння в
    міжнародних правових аспектах та вміння швидко адаптуватися до
    складних ситуацій. Його професійний підхід і досвід роботи в
    галузі міжнародного права зробили його відмінним юристом для
    моїх потреб. Я рекомендую Олександра Петрова всім, хто потребує
    якісної юридичної підтримки у справах, пов'язаних з міжнародним
    бізнесом.`,
  },
  {
    name: "Ігор",
    imageSrc: "./img/igor.jpg",
    text: `Я хочу поділитися своїм враженням від співпраці з Максимом Волковим, експертом у справах корпоративного права та нерухомості. Під час нашої спільної роботи я переконався у його великому досвіді в юридичній сфері, що дорівнює понад 20 рокам. Максим продемонстрував свою здатність ефективно представляти інтереси клієнтів, зокрема кількох великих корпорацій у складних судових справах.
    Особливо вражає аналітичний підхід Максима до кожної задачі та його здатність думати стратегічно. Він завжди готовий вдатися до найбільш глибокого аналізу ситуації, знайти оптимальні рішення та розробити ефективну стратегію, спрямовану на досягнення успіху для своїх клієнтів.
    Робота з Максимом Волковим була для мене надзвичайно позитивним досвідом. Його професійний підхід, аналітичність та здатність швидко знаходити найкращі рішення роблять його справжнім фахівцем у своєму галузі.`,
  },
  {
    name: "Олексій",
    imageSrc: "./img/alex.webp",
    text: `Дозвольте поділитися своїми враженнями про співпрацю з Юлією Гончарук у справах інтелектуальної власності. Її безсумнівний досвід у реєстрації патентів, торгових марок та авторських прав дійсно вражає. Юлія проявила вміння ефективно захищати мою інтелектуальну власність від можливих порушень та незаконного використання.
    Її професійний підхід та здатність забезпечити мої права на інтелектуальну власність вразили мене. Я відчував себе повністю підтриманим під час нашої співпраці. Юлія завжди готова надати необхідну допомогу підприємцям та творчим особистостям у захисті їхніх прав.
    Рекомендую Юлію Гончарук як професіонала у справах інтелектуальної власності, яка глибоко занурюється у потреби своїх клієнтів та надає відмінний рівень обслуговування.`,
  },
];

function showFeedback(index) {
  const { imageSrc, text, name } = feedbacks[index];
  feedbackImg.src = imageSrc;
  feedbackArticle.textContent = text;
  feedbackName.textContent = name;
}

prevBtn.addEventListener("click", () => {
  currentFeedbackIndex =
    (currentFeedbackIndex - 1 + feedbacks.length) % feedbacks.length;
  showFeedback(currentFeedbackIndex);
});

nextBtn.addEventListener("click", () => {
  currentFeedbackIndex = (currentFeedbackIndex + 1) % feedbacks.length;
  showFeedback(currentFeedbackIndex);
});

// Показати перший відгук при завантаженні сторінки
showFeedback(currentFeedbackIndex);
